[
  {
    "title": "Что-же такое React",
    "link": "#",
    "image": "./img/ReactTOP.jpg",
    "userId": "1",
    "userName": "Олег",
    "body": "React - это библиотека JavaScript, которая используется для создания пользовательского интерфейса. React был создан компанией Facebook, а первый релиз библиотеки увидел свет в марте 2013 года. Текущей версий на данный момент (октябрь 2017 года) является версия React v16.0.Первоначально React предназначался для веба, для создания веб-сайтов, однако позже появилась платформа React Native, которая уже предназначалась для мобильных устройств.React представляется идеальный инструмент для создания масштабируемых веб-приложений (в данном случае речь идет о фронтенде), особенно в тех ситуациях, когда приложение представляет SPA (одностраничное приложение).React относительно прост в освоении, имеет понятный и лаконичный синтаксис."
  },
  {
    "title": "Виртуальный DOM",
    "link": "#",
    "image": "./img/ReactTOP.jpg",
    "userId": "2",
    "userName": "Иван",
    "body": "Вся структура веб-страницы может быть представлена с помощью DOM (Document Object Model)- организация элементов html, которыми мы можем манипулировать, изменять, удалять или добавлять новые. Для взаимодействия с DOM применяется язык JavaScript. Однако когда мы пытаемся манипулировать html-элементами с помощью JavaScript, то мы можем столкнуться со снижением производительности, особенно при изменении большого количества элементов. А операции над элементами могут занять некоторое время, что неизбежно скажется на пользовательском опыте. Однако если бы мы работали из кода js с объектами JavaScript, то операции производились бы быстрее.\n"
  },
  {
    "title": "Другие особенности React",
    "link": "#",
    "image": "./img/ReactTOP.jpg",
    "userId": "3",
    "userName": "Ольга",
    "body": "Другой отличительной чертой библиотеки является концентрация на компонентах - мы можем создать отдельные компоненты и затем их легко переносить из проекта в проект.\n"
  }
]
